In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [ ]:
randn(5,4)

In [4]:
df = pd.DataFrame(randn(5,4), ["a","b","c","d","e"], ["w","x","y","z"])

In [5]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [6]:
df["z"]["e"]

0.6835088855389145

In [7]:
df.w

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [8]:
df[["w","z"]]

          w         z
a  2.706850  0.503826
b  0.651118  0.605965
c -2.018168 -0.589001
d  0.188695  0.955057
e  0.190794  0.683509

In [9]:
df["new"] = df["w"] + df["z"]

In [10]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [11]:
df.drop("e", axis=0)

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [12]:
df.loc["a"]

w      2.706850
x      0.628133
y      0.907969
z      0.503826
new    3.210676
Name: a, dtype: float64

In [13]:
df>0

       w      x      y      z    new
a   True   True   True   True   True
b   True  False  False   True   True
c  False   True   True  False  False
d   True  False  False   True   True
e   True   True   True   True   True

In [14]:
abs(df)*2**2

           w         x          y         z        new
a  10.827399  2.512531   3.631878  2.015303  12.842702
b   2.604472  1.277272   3.392308  2.423861   5.028333
c   8.072673  2.960488   2.115254  2.356002  10.428675
d   0.754781  3.035488   3.732949  3.820226   4.575007
e   0.763177  7.915029  10.423869  2.734036   3.497213

In [15]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [16]:
df.drop("new", axis=1, inplace=True)

In [22]:
df[[df]>0]

TypeError: '>' not supported between instances of 'list' and 'int'

In [26]:
df["z"]>0

a     True
b     True
c    False
d     True
e     True
Name: z, dtype: bool